import rose1 from '@/assets/imgs/rose1.png'
import rose2 from '@/assets/imgs/rose2.png'
import rose3 from '@/assets/imgs/rose3.png'
import rose4 from '@/assets/imgs/rose4.png'
import rose5 from '@/assets/imgs/rose5.png'

// https://588ku.com/ku/searchByPic?type=13&id=10450503

const roses = [rose1, rose2, rose3, rose4, rose5]

export const bookContents = [
  {
    title: '很开心我们出现在彼此的生命里',
    content: [
      '很开心我们出现在彼此的生命里',
      '成为彼此很重要的人',
      '离不开也不想离开的人',
      '虽然我不是那个一直暖心的人',
      '也会有闹脾气和不理解',
      '但我希望我在你的眼里',
      '依然是很好的那个',
    ],
    img: rose1,
  },
  {
    title: '同频的人会在终点等你',
    content: [
      '很久之前 我就告诉自己',
      '恋爱之前一定要搞清楚自己想要的是什么',
      '后来终于有了答案',
      '我想我不需要一个“酒肉恋人”',
      '吃饭喝酒逛街过节',
      '宿舍楼下亲嘴视频吵架分手',
      '我需要的是人生战场的盟友',
      '同频共振兼容并蓄',
      '源源不断地向对方提供',
      '稳定的爱意与情绪价值',
      '品行端王 教育好 三观相合',
      '但感情上永远偏向我',
      '虽互相拥有 但彼此独立',
    ],
    img: rose2,
  },
  {
    title: '很开心能遇见你',
    content: [
      '遇见你',
      '是我幸福的开始',
      '你迟到了很多年',
      '可我依然为你的到来而高兴',
      '我想给你的东西实在太多',
      '一场相遇，一生铭记',
      '不负遇见，不谈亏欠',
      '你再不好，我都喜欢',
      '因为你是我这辈子，毫无保留的',
      '一次深爱',
      '十里春风，不及相遇有你',
      '晴空万里，不及心中有你💗',
    ],
    img: rose3,
  },
  {
    title: '你是我坚定的选择',
    content: [
      '不知道怎么描述对你的喜欢',
      '只知道有你在，会心安',
      '你回信息，会开心',
      '想起你时，心里会很甜',
      '而这种感觉对别人都没有',
      '我只感受到了你',
      '可能你就是那刚刚好的感觉',
      '你流向了我',
      '便形成了风',
    ],
    img: rose4,
  },
  {
    title: '爱是因为你值得',
    content: [
      '爱从来不是选择',
      '也不是不合适就分',
      '腻了就换',
      '而是让人感到温柔和勇敢',
      '是充满安全感的坚定',
      '所以，我想让你知道',
      '我对你的爱不是一时兴起',
      '而是内心深处无数次的心动',
      '是情感，是你值得！',
    ],
    img: rose5,
  },
  {
    title: '结婚誓词',
    content: [
      '你迟到的这些年',
      '让我差点以为人生不过如此',
      '可当你出现后',
      '我又原谅了世间这些年交付给我的磨难',
      '遇上你的感觉',
      '大概就是走了很远的路',
      '而现在终于到家了',
      '谢谢你靠近我',
      '了解我，温暖我，治愈我，陪伴我',
      '谢谢你能来爱我',
      '我也爱你，永远爱你❤️',
    ],
  },
  {
    title: '爱上所有阶段的你',
    content: [
      '你总说你胖了',
      '我会不喜欢胖了的你',
      '但我要告诉你',
      '无论你胖瘦、贫穷与富贵',
      '我都会一如既往的',
      '喜欢着你，宠溺着你',
      '我们之间的距离，很近',
      '只隔着一个手机屏幕',
      '也很远，是一天的舟车劳顿',
      '我们那么远，却又那么近',
      '因为你就在我心里，无可替代',
      '因为对方是你',
      '那这份爱便是撑起我走下去的信念',
    ],
  },
  {
    title: '别担心',
    content: [
      '宝，别担心',
      '结婚习俗',
      '再过繁琐，再过费事费力',
      '都不及我对你的爱',
      '我爱你',
      '我会用出我全身的力气',
      '去做好结婚的准备',
      '做到你满意，你家人满意',
      '请你一定相信我',
      '爱你，我的宝❤️',
    ],
  },
  {
    title: '喜欢你',
    content: [
      '林微因说过很多人喜欢你',
      '或因为你漂亮，或因为你说话机灵有趣',
      '这些喜欢都暗含着很多期望',
      '而我对你的喜欢',
      '却是想要和你过一辈纸',
      '你是我现实中理想的另一半',
      '你知我，你懂我',
      '请让我一直都能喜欢着你'
    ],
  },
  {
    title: '想对你说',
    content: [
      '我很在乎你',
      '在乎你的情绪，在乎你对我的态度',
      '更加在乎你爱不爱我',
      '我突然发现',
      '爱你爱的有的失去了自我',
      '爱的患得患失，爱的小心翼翼',
      '害怕惹你生气，害怕你不开心',
      '所以，我想对你说',
      '在你不开心的时候，你可以对我说',
      '在你生气的时候，你可以对我讲',
      '我会为你分担，我会逗你开心',
      '因为我的世界少不了你',
    ],
  },
].map(item => {
  if (item.img) {
    return item;
  }
  return {
    ...item,
    img: roses[Math.floor(Math.random()*5)+1]
  }
})
